## Debug and get the desired results

### 1.Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.

In [1]:
# Two dataframes given

Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}

car_Horsepower = {'Company ': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [ ]:
# Solution code

### 2.Read a dataset of movie reviewers by modifying the parameters as required. The expected output is shown below.

In [10]:
# desired output

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
import pandas as pd

# columns to be used
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

# reading the data
users = pd.read_table('http://bit.ly/movieusers')

users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [12]:
# Solution code

### 3.Read the data and create a subset dataframe of movies with a rating of 9 or above in the crime genre.

In [ ]:
# read a dataset of top-rated IMDb movies into a DataFrame
movies = pd.read_table('http://bit.ly/imdbratings')
print(movies.head())

# Applying the required condition
movies[movies['genre'] = 'Crime' and movies['star_rating'] > 9]

In [ ]:
# Solution code